---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceEdgeNumber
source: html/235739f8-f2b7-894d-8776-17f30ded9b7b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceEdgeNumber Property

"Edge number"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfaceEdgeNumber { get; }
```